Repository: constantin-b/codeflavors-featured-post
Catalog: languages/cfp-*.po
Languages: ro_ro

source: Insert new featured post
ro_ro: Adaugă articol reprezentativ nou

source: Edit featured post properties
ro_ro: Editați proprietățile articolului reprezentativ

source: Category/Term (optional)
ro_ro: Categorie/Termen (opțional)

source: Taxonomy name (optional)
ro_ro: Denumire taxonomie (opțional)

source: Post type
ro_ro: Tip articol

source: Post ID (if set, will override all other options)
ro_ro: ID Articol (când este introdus, restul opțiunilor vor fi ignorate)

source: Number of posts
ro_ro: Număr articole

source: Post offset
ro_ro: Primul articol

source: Template
ro_ro: Șablon

source: Close
ro_ro: Închide

source: No taxonomy
ro_ro: Fără taxonomie

source: No options
ro_ro: Fără opțiuni

source: Choose
ro_ro: Alegeți

source: CodeFlavors Featured Post
ro_ro: Articol Reprezentativ - CodeFlavors

source: Featured Post by CodeFlavors
ro_ro: Articol reprezentativ creat de CodeFlavors

source: Feature any post type.
ro_ro: Publicați orice tip de articol.

source: Content
ro_ro: Conținut

source: Taxonomy name
ro_ro: Nume taxonomie

source: Category/Term
ro_ro: Categorie/Termen

source: Enter category/term name or ID
ro_ro: Introduceți numele categoriei/termenului sau ID-ul acestuia

source: Number of posts to retrieve
ro_ro: Numărul de articole prezentate

source: Skip posts (ie. to retrieve starting with the second post, set the offset to 1)
ro_ro: Săriți articole (spre exemplu, pentru a extrage articole începând cu al doilea articol, introduceți valoarea 1)

source: Post ID
ro_ro: ID articol

source: When set, will override all other parameters and return the post having this ID.
ro_ro: Când este introdusă, această opțiune va anula toți ceilalți parametri și va returna articolul pentru care ați introdus ID-ul.

source: Select one of the available templates to display the featured post.
ro_ro: Selectați unul dintre șabloanele existente pentru a afișa articolul reprezentativ.

source: Fancy
ro_ro: Elegant

source: Default template
ro_ro: Șablon de bază

source: %s comment
ro_ro: %s comentariu

source: Add a CodeFlavors Featured Post widget
ro_ro: Adăugați un articol reprezentativ CodeFlavors

source: Widget title
ro_ro: Titlu

source: Taxonomy
ro_ro: Taxonomie

source: None selected
ro_ro: Nici o selecție

source: Posts offset
ro_ro: Primul articol

source: Post ID (will override all other options)
ro_ro: ID articol (restul opțiunilor vor fi ignorate)

source: The category/taxonomy ID to retrieve the latest post from.
ro_ro: Categoria/Taxonomia din care vor fi extrase articolele reprezentative.

source: The taxonomy name, if retrieving from anything else other than regular categories.
ro_ro: Numele taxonomiei dacă se extrag articole din altceva în afară de categoriile obișnuite.

source: The post type that should be retrieved from the given taxonomy. Not required when featuring regular posts.
ro_ro: Tipul de articol care ar trebui extras din taxonomia dată. Nu este necesar pentru articolele obișnuite.

source: The number of posts to retrieve.
ro_ro: Numărul de articole ce vor fi extrase.

source: First row to return (ie. a value of 1 means it will return starting with the second most recent post).
ro_ro: Primul rezultat ce va fi returnat (spre exemplu, o valoare egală cu 1 va returna rezultatele începând cu al doilea articol).

source: A post ID. This will retrieve the exact post ID and will override all other parameters if set.
ro_ro: Un ID de articol. Aceasta opțiune va extrage exact articolul căruia îi corespunde ID-ul.

source: The featured post template to use when displaying a post.
ro_ro: Șablonul ce va fi folosit pentru a afișa articolul reprezentativ.

source: default
ro_ro: Șablon de bază
